Autodesk.Revit.UI.IDropHandler.Execute(Autodesk.Revit.UI.UIDocument,System.Object)
Implement this method to handle the drop event for your data.
document: The document on which the data was dropped.
data: The data.
Since:
2013

Autodesk.Revit.UI.IDropHandler
An interface to be executed when custom data is dragged and dropped onto the Revit user interface.
Remarks:
Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.
Since:
2013

Autodesk.Revit.UI.IDropHandler.Execute(Autodesk.Revit.VSTA.DocumentEntryPoint,System.Object)
Implement this method to handle the drop event for your data.
document: The document on which the data was dropped.
data: The data.
Since:
2013